USE test;

DROP TABLE IF EXISTS part;
CREATE TABLE part (
  id INT(11) NOT NULL AUTO_INCREMENT,
  `name` VARCHAR(100) NOT NULL,
  `required` BIT(1) NOT NULL DEFAULT b'0',
  `amount` INT(8),
  PRIMARY KEY (`id`))
  ENGINE = InnoDB
  DEFAULT CHARACTER SET = utf8;

INSERT INTO part (`name`, `required`, `amount`) VALUES ('материнская плата', 1, 5),
('звуковая карта', 0, 1),
('процессор', 1, 7),
('подсветка корпуса', 0, 0),
('HDD диск', 0, 5),
('корпус', 1, 10),
('память', 1, 7),
('SSD диск', 1, 8),
('видеокарта', 0, 10),
('клавиатура', 1, 10),
('монитор', 1, 8),
('принтер', 0, 2),
('наушники', 0, 1),
('мышка', 0, 10),
('система охлаждения', 0, 1),
('блок питания', 0, 5),
('веб-камера', 0, 3),
('сканнер', 0, 1),
('микрофон', 0, 6),
('флэшка USB', 0, 19),
('игровой джойстик', 0, 4),
('переходник', 0, 22),
('сетевой адаптер', 0, 2),
('клавиатура USB', 0, 1),
('диск USB', 0, 2);
